#+TITLE: The Joy of Clojure
#+DATE: 2020-05-25

- tags :: [[file:book.org][book]] [[file:lisp.org][Lisp]] [[file:clojure.org][Clojure]]

defn-

letfn

#+BEGIN_SRC clojure
(defn lookup3 [board pos]  (let [[file rank] (map int pos)        [fc rc]     (map int [\a \0])        f (- file fc)        r (* 8 (- 8 (- rank rc)))        index (+ f r)]    (board index)))(lookup3 (initial-board) "a1")
#+END_SRC

#+BEGIN_SRC clojure
(defn initial-board []
[\r \n]
[\p \p]
[\- \-]
[\- \-]
[\P \P]
[\R -N])
#+END_SRC

* play
#+BEGIN_SRC clojure
(def frame (java.awt.Frame.))
#+END_SRC

#+RESULTS:
: #'user/frame

#+BEGIN_SRC clojure
(for [meth (.getMethods java.awt.Frame)
      :let [name (.getName meth)]
      :when (re-find #"Vis" name)]
  name)
#+END_SRC

#+RESULTS:
| setVisible | isVisible |

#+BEGIN_SRC clojure
(.setVisible frame true)
#+END_SRC

#+RESULTS:

(.setSize frame (java.awt.Dimension. 200 200))

he Clojure clojure.java.javadoc namespace has a javadoc function to query and
view official API documentation: (javadoc frame)

#+BEGIN_SRC clojure
(def gfx (.getGraphics frame))
(.fillRect gfx 100 100 50 75)
(.setColor gfx (java.awt.Color. 255 128 0))
(.fillRect gfx 100 150 75 50)
#+END_SRC

